<a href="https://colab.research.google.com/github/brendanpshea/database_sql/blob/main/Database_02_RelationalModel_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Tomes of Tables: A Librarian's Guide to the Relational Model and SQL Basics
### Brendan Shea, PhD

Welcome to Chapter 2 of our journey through the fascinating world of data management! In this chapter, we'll be stepping into the realm of the relational model – a fundamental and foundational concept in the field of databases that has revolutionized how we handle and interpret information.

The relational model is much like a well-organized school library, where books are categorized and arranged in a way that makes it easy to find and connect different pieces of information. We will dive deep into the history of the relational model, exploring its importance, and uncovering the basic concepts that make it an indispensable part of modern data management.

We'll set the stage with an extended case study: "The Librarian at Unseen University Decides to Use a Database". Our librarian faces the challenge of efficiently organizing vast amounts of books, which are like the data we handle daily. As we delve into the world of the librarian, you'll learn how a database, much like a library, can help manage and simplify complex, interrelated pieces of information.

We'll cover the reasons to adopt a relational database, drawing parallels between the needs of our librarian and the needs of modern businesses and organizations. From simplifying data retrieval to enhancing data integrity, we'll explore why relational databases have become the standard in information management.

From there, we'll introduce you to the basic building blocks of a relational database: tables, attributes, and keys. Imagine tables as shelves in our library, attributes as different aspects of the books, and keys as unique identifiers for each book. We'll learn how these concepts interact to store and retrieve information efficiently.

In the sections on foreign keys and types of relationships, we'll explore how books (or data) are not isolated, but instead, they often have connections with each other. A book may have the same author, similar themes, or be part of a series – these relationships mirror the ones in a database.

Next, we'll tackle database normalization – the practice of designing our 'library' to minimize redundancy and improve integrity. It's like ensuring that each book is placed where it should be, and no two books are confused with each other.

Finally, we'll get hands-on with SQLite, a popular database management system. Imagine it as the library's catalogue system, helping you find and organize your books. We'll cover various commands, from SELECT, FROM, ORDER, and LIMIT to more advanced techniques like filtering text with WHERE and LIKE, filtering numbers and dates with operators, and using AND, OR, and NOT. By the end of this chapter, you'll be able to command your database to find and manipulate data, much like how a librarian navigates their library.

So, grab your library card, and let's start exploring the world of the relational model!

## Brendan's Lecture
Click on the following cell to launch my lecture.

In [ ]:
from IPython.display import YouTubeVideo
YouTubeVideo('GThF8Vs7uJY', width=800, height=500)

### Introduction to the Relational Model

The**relational model**, an underpinning element of modern data management, has an intriguing history that dates back to the late 1960s. It was first proposed by an English computer scientist named Edgar F. Codd while he was working at IBM. He imagined a new method of structuring data that would make it easier to manage, manipulate, and understand.

Codd saw data much like a vast city of information, bustling with activity. At that time, data was often stored in hierarchical or network models---imagine trying to navigate through a city with only a few main roads and many cul-de-sacs. It could be tedious and complex. Codd's vision? To turn this into a well-planned city with structured streets and intersections---each data point accessible from any direction. This vision became the foundation of the relational model.

The importance of the relational model can't be overstated. It has revolutionized the way we store, retrieve, and manipulate data. Businesses, governments, hospitals, schools, and countless other organizations depend on relational databases for everything from inventory management to patient records, from academic research to finance. The relational model made it possible to link related pieces of information, thereby turning raw data into meaningful insights.

The relational model's basic concepts are deceptively simple and incredibly powerful:

1.  **Tables** (or **Relations**): The model gets its name from these "relations". Tables are like a grid with rows and columns, where each row represents a single data entity (like a book in our library), and each column represents an attribute of that entity (like the book's title, author, or publication year).

2.  **Attributes:** These are the properties or characteristics of an entity. In the library analogy, attributes could be the title, author, publisher, or genre of a book. In a table, each column represents an attribute.

3.  **Keys:** Keys are unique identifiers for each row in a table. They're like the unique call number for a book in a library, allowing you to find exactly what you're looking for. There are various types of keys in a relational model, including primary keys (unique to each row), foreign keys (linking rows between tables), and candidate keys (potential primary keys).

These concepts come together to form a relational database, turning rows and columns of data into a rich, interconnected web of information. Much like a well-organized library, this structure allows users to locate specific data (books), understand their attributes (details), and see their connections to other data (related books).

## Chapter Case Study: The Librarian at Unseen University Decides to Use a Database

In Terry Pratchett's Discworld series, the Unseen University houses a vast library of unique and peculiar books. Our central character in this case study is the university's Librarian, an orangutan with the arduous task of managing this unconventional collection. The books at Unseen University aren't like the ones you'd find in an ordinary library. Some are magical, some sentient, while others exhibit peculiar behaviors like changing their content or disappearing altogether. These unique characteristics pose a significant challenge when it comes to cataloging and tracking each book.

Recognizing that a standard library catalogue system falls short in managing such a dynamic collection, the Librarian decides to implement a database. He envisions a system capable of capturing each book's attributes, from the standard details like title and author to more unusual traits such as magical properties and behaviors.

In our case study, we'll accompany the Librarian on this ambitious project, using his challenges and solutions as practical examples to understand the relational model's intricacies better. From setting up tables to defining unique keys and maintaining relationships between data, we'll see how a well-designed database can help bring order to even the most magically chaotic library.

## Tables, Attributes, and Keys

Understanding the concepts of tables, attributes, and keys is vital when working with a relational database. To clarify these terms, we'll refer back to our case study at the Unseen University library.

1.  **Tables:** A table, or relation, in a database is like a single shelf or section in our library. It holds a set of related data. For instance, a table in our librarian's database might be "Books", storing information about all the books in the library. Another table might be "Authors", containing details about authors of the various books.

2.  **Attributes:** Attributes are the specific pieces of data that characterize the entities in a table. They can be thought of as the different details we have about each book on our "Books" shelf. For example, an attribute of a book might be its title, author, publication year, genre, page count, or magical properties. In a table, these attributes form the columns. So, in our "Books" table, we might have columns for "Title", "Author", "Publication_Year", "Genre", and "Pages".

3.  **Keys:** Keys are like the unique identifiers we use to locate a specific book in the library. In a database, keys help us identify unique rows in a table. In our case study, each book might have a "Book_ID" that is unique to it - this would be its key in the "Books" table. There are different types of keys in a database:

    -   **Primary Key:** This is a unique identifier for a record in a table. In our "Books" table, the "Book_ID" could be the primary key, as it is unique to each book.

    -   **Foreign Key:** This is a key in a table that establishes a link between data in two tables. For instance, our "Books" table might have an "Author_ID" column that links to the "Authors" table, creating a connection between a book and its author.

    -   **Candidate Key:** This is a field or a set of fields that can act as a primary key. For example, if every book had a unique title, then "Title" could be a candidate key.

Understanding these three concepts is the first step towards effectively using relational databases. As we navigate through our case study, these fundamental components will become even clearer, providing a solid foundation for your exploration of the relational model.

## Sample Tables

As a first try, here's a simple relational data model that our friendly Librarian might come up with:

### Books Table

| Book_ID | Title | Author_ID | Publication_Date | Genre | Pages |
| --- | --- | --- | --- | --- | --- |
| 1 | 'The Transmuting Toadstool' | 1 | '1071-04-15' | 'Transmutation' | 310 |
| 2 | 'Ghoul Goulash: A Necromancy Narrative' | 2 | '1075-10-31' | 'Necromancy' | 500 |
| 3 | 'The Drunken Diviner' | 3 | '1077-07-07' | 'Divination' | 200 |
| 4 | 'Bewitched Broomsticks: Household Magic' | 1 | '1080-12-21' | 'Household' | 185 |
| 5 | 'Alchemy of Amphibians' | 1 | '1082-03-01' | 'Transmutation' | 312 |

In the "Books" table, Book_ID is the Primary Key (PK), and Author_ID is a Foreign Key (FK) that references the Author_ID in the "Authors" table.

### Authors Table

| Author_ID (PK) | Name | Birth_Date |
| --- | --- | --- |
| 1 | 'Mostrum Ridcully' | 1045-02-28 |
| 2 | 'Granny Weatherwax' | 1040-06-11 |
| 3 | `Susan Death' | 1060-12-17|

In the "Authors" table, Author_ID is the Primary Key (PK). This table gives us additional information about the authors of the books in the library.

Remember, this is a simplified view. In a real-world application, tables in a relational database might have many more fields and much more data. Also, please note that in a real database, the keys would be indicated in the database schema rather than directly in the table.

## Types of Relationships Between Tables
There are three basic **cardinarilites** of possible relationships between tables in a relational database: one-to-one, one-to-many (or many-to-one), and many-to-many.

### One-to-One:
In a one-to-one relationship, one record in a table corresponds to one and only one record in another table.

-   Example 1: If the librarian had a "Librarian" table with a unique record for each librarian working at the library and a "Library_Section" table with a unique record for each library section, a one-to-one relationship could exist if each librarian was responsible for exactly one section, and each section was managed by exactly one librarian.

-   Example 2: Consider a "Books" table and a "Book_Cover" table. If every book in the library has a unique cover and each cover is designed for a specific book, there would be a one-to-one relationship between the books and their covers.

-   Example 3: In a business context, if a company has a "CEO" table and a "Company" table, there could be a one-to-one relationship, as each CEO leads only one company, and each company has only one CEO.

### One-to-Many:
This is the most common relationship type. In a one-to-many relationship, one record in a table can relate to multiple records in another table.

-   Example 1: For instance, one author (in the "Authors" table) can write many books (in the "Books" table). But each book is written by only one author. This is a one-to-many relationship from authors to books.

-   Example 2: In our "Librarian" table, one librarian could be responsible for many books. However, each book is managed by only one librarian. This creates a one-to-many relationship from librarians to books.

-   Example 3: If a "Publisher" table were added to the library database, one publisher could publish many books, but each book would be published by one publisher, creating a one-to-many relationship from publishers to books.

### Many-to-Many:
In a many-to-many relationship, one record in a table can relate to many records in another table, and vice versa.

-   Example 1: Let's say our librarian introduces a "Categories" table to categorize books (like Magic, Witchery, etc.). A book can belong to multiple categories, and each category can contain multiple books. This is a many-to-many relationship. To handle such relationships, we typically use a junction table that holds the primary keys of both related tables.

-   Example 2: Consider a "Readers" table and the "Books" table. A reader could read many books, and each book could be read by many readers. This creates a many-to-many relationship. A "Reading" junction table, containing the reader's ID and the book's ID, could be used to manage this relationship.

-   Example 3: If the library were to run "Events", with each event attended by many readers and each reader able to attend many events, a many-to-many relationship would exist between "Readers" and "Events". This could be managed with an "Attendance" junction table, storing the IDs of both the reader and the event.

## Database Normalization
In the quest for an efficient, flexible, and reliable database, we stumble upon the concept of **database normalization**. This is a process that involves structuring a database in accordance with a series of so-called normal forms to reduce data redundancy and improve data integrity. In our Unseen University library case study, normalization would help the librarian to minimize duplicate data and ensure consistency.

Normalization involves a set of rules or guidelines known as normal forms. Let's examine some of these forms:

1.  **First Normal Form (1NF)**: According to 1NF, each column of a table should have atomic (indivisible) values, and each row must be unique. For example, instead of having a "Genres" column in our "Books" table that lists multiple genres for a book, we would have a separate row for each genre that the book falls under.

2.  **Second Normal Form (2NF)**: To fulfill 2NF, all non-key columns in the table must depend on the entire primary key. In the context of our library, if we had a table where the primary key is a composite key (e.g., Book_ID and Edition), every other column in the table should be related to both these components, not just one.

3.  **Third Normal Form (3NF)**: According to 3NF, all non-key columns should not depend on other non-key columns. For instance, if our "Books" table also included a column for "Author_Birth_Year", this would violate 3NF as "Author_Birth_Year" is dependent on "Author", which is a non-key column. Instead, "Author_Birth_Year" should be moved to the "Authors" table.

4.  Beyond 3NF: There are more advanced normal forms beyond 3NF, like Boyce-Codd Normal Form (BCNF), 4NF, and 5NF. These tackle more complex scenarios and dependencies. However, for most applications, achieving 3NF is considered sufficient.

Normalization comes with advantages such as reducing data redundancy, improving data integrity, and making the database more flexible to changes. But it's important to note that it isn't always the best approach. In some cases, a certain degree of data redundancy might be acceptable or even beneficial for performance reasons.

As our librarian continues to refine the database for the Unseen University library, understanding normalization can help ensure that the database is designed in a way that best suits the library's unique needs.

## SQL (Structured Query Language)

SQL, an acronym for Structured Query Language, is a programming language specifically designed for managing and manipulating databases. It's the standard language for relational database management systems (RDBMS), which are a type of database management system (DBMS) that store data in the form of related tables. SQL allows us to perform various operations on a database such as querying, inserting, updating, and deleting data.

SQL is fundamental to the operation of relational databases. It allows us to build and modify the structure of databases, define the type and nature of the data that they will hold, and create relationships between different pieces of data.  SQL commands can be broadly categorized into four types, each serving different purposes:

1.  **Data Definition Language (DDL):** These commands are used to define or modify the structure of a database and its tables. The main DDL commands are CREATE (to create new tables), ALTER (to modify existing tables), and DROP (to delete tables).

2.  **Data Manipulation Language (DML):** DML commands are used to manipulate the data within tables. The primary DML commands are SELECT (to retrieve data), INSERT (to add new data), UPDATE (to modify existing data), and DELETE (to remove data).

3.  **Data Control Language (DCL):** DCL commands are used to control access to data within the database. GRANT and REVOKE are two key DCL commands.

4.  **Transaction Control Language (TCL):** TCL commands like COMMIT, ROLLBACK, and SAVEPOINT are used to manage transactions within a database.

When our librarian at Unseen University builds his database and starts to populate it with the library's book and author data, he'll be using SQL. Whether he's adding new books to the database, updating an author's details, or retrieving a list of books in a specific category, SQL will provide the tools needed to perform these tasks efficiently and effectively.

In the following sections, we'll explore some of the most commonly used SQL commands and learn how to use them to interact with a relational database. These SQL skills will equip our librarian to manage the Unseen University library database effectively, keeping track of the ever-growing collection of magical (and occasionally explosive) books.

### Unseen Library: Questions
1. What are the advantages of using a relational database for something like a library? (Most real-world libaries use them!).
2. The data model we've described so far (the list of tables and attributes) is pretty minimal. What sorts of tables and attributes might we want to add? why?
3. What are the similarities between a relational database and a real-world "library"? What are the differences?
4. Relational databases can be used to handle *many* types of data. Give an example of a topic related to a hobby of yours and describe a relational database for it. You should describe the "tables" and their "attributes."

### Unseen Library: My Answers
1.

2.

3.

4.

## Setting Up SQL
To use SQL in a Jupyter notebook, we first have to load the SQL extension using the `%load_ext` magic command. Then, we can connect to our SQLite database. Here's how to create the two tables:

In [ ]:
# First, we create a database and connect to it
%load_ext sql
%sql sqlite:///unseen_library.db

### Making Tables with CREATE TABLE
To begin, let's create a few tables. We'll be covering the process of table creation in more detail in later chapter, so we don't need to worry too much about the details (yet). First, let's create the Author's table:

In [ ]:
%%sql

DROP TABLE IF EXISTS Authors;
CREATE TABLE Authors (
    Author_ID INTEGER PRIMARY KEY, -- this is unique for every author
    Name VARCHAR(48) NOT NULL, -- up to 48 chars long
    Birthdate DATE -- in yyyy-mm-dd format
);

 * sqlite:///unseen_library.db
Done.
Done.

[]

In this table, `Author_ID` is the primary key (a unique identifier for each author), `Name` is the author's name, and `Birthdate` is the author's birthdate.

Now, we can create the `Books` table:

In [ ]:
%%sql

DROP TABLE IF EXISTS Books;

CREATE TABLE Books (
    Book_ID INTEGER PRIMARY KEY,
    Title VARCHAR(64) NOT NULL, -- a book MUST have a title
    Author_ID INTEGER, -- used to link to author table
    Publication_Date DATE,
    Genre VARCHAR(32),
    Pages INTEGER,
    FOREIGN KEY(Author_ID) REFERENCES Authors(Author_ID)
);

 * sqlite:///unseen_library.db
Done.
Done.

[]

In the "Books" table,`Book_ID` is the primary key, `Title` is the book's title, and `Publication_Date` is when the book was published. `Author_ID` is a foreign key that refers to the Author_ID in the "Authors" table, creating a link between each book and its author. Finally, `Genre` and `Pages` keep track of important infrormation about the book.

### Adding data with INSERT
Now, we can add some data to our tables. Again, this is something we'll be covering in more detail later. First, let's add information for three authors:

In [ ]:
%%sql
DELETE FROM Authors;
INSERT INTO Authors (Author_ID, Name, Birthdate)
VALUES
    (1, 'Mostrum Ridcully', '1045-02-28'),
    (2, 'Granny Weatherwick', '1040-06-11'),
    (3, 'Susan Death', '1060-12-17');

 * sqlite:///unseen_library.db
3 rows affected.
3 rows affected.

[]

Now, we can information about the books:

In [ ]:
%%sql

DELETE FROM Books;
INSERT INTO Books (Book_ID, Title, Author_ID, Publication_Date, Genre, Pages)
VALUES
(1, 'The Transmuting Toadstool', 1, '1071-04-15', 'Transmutation', 310),
(2, 'Ghoul Goulash: A Necromancy Narrative', 2, '1075-10-31', 'Necromancy', 500),
(3, 'The Drunken Diviner', 3, '1077-07-07', 'Divination', 200),
(4, 'Bewitched Broomsticks: Household Magic', 1, '1080-12-21', 'Household', 185),
(5, 'Alchemy of Amphibians', 1, '1082-03-01', 'Transmutation', 312),
(6, 'Lunch with the Living Dead', 2, '1086-08-15', 'Necromancy', 503),
(7, 'The Prophetic Pint: A Tavern Diviner’s Guide', 3, '1088-09-09', 'Divination', 202),
(8, 'Cauldron Conundrums: Household Spells', 1, '1090-01-31', 'Household', 190),
(9, 'Frog or Prince? The Transmutation Dilemma', 1, '1095-05-05', 'Transmutation', 320),
(10, 'Dinner with the Deceased: A Necromancer’s Diary', 2, '1100-12-01', 'Necromancy', 520),
(11, 'The Seer’s Stein: A Pub Divination Primer', 3, '1107-11-11', 'Divination', 210),
(12, 'Magic Mops and More: A Household Guide', 1, '1110-02-28', 'Household', 195),
(13, 'Lizard or Lord? The Transmutation Challenge', 1, '1115-06-06', 'Transmutation', 330),
(14, 'Resurrecting Rodents: A Necromancer’s Notes', 2, '1120-09-01', 'Necromancy', 550),
(15, 'The Predictive Pilsner: Alehouse Divination Decoded', 3, '1125-11-11', 'Divination', 220);

 * sqlite:///unseen_library.db
15 rows affected.
15 rows affected.

[]

## Starting with SQL: SELECT and FROM

Ok, now that we've created our tables and added some data, we can starting using our database (and learn some basic SQL along the way).

The most basic SQL command is `SELECT`, which is used to **query** the data from a database. Here "query" means to fetch data from one or multiple tables where the data complies with certain criteria. It is the most commonly used command in SQL to perform tasks that relate to the fetching or retrieving of data from a database.  The simplest form of a `SELECT` statement is:

```
SELECT column1, column2, ..., columnN
FROM table_name;

```

In this syntax, `column1, column2, ..., columnN` are the names of the columns you want to select from table_name. If you want to select all columns, you can use the `*`  symbol as a shorthand:

```
SELECT *
FROM table_name;
```
Let's say the Librarian at Unseen University wants to view a list of all the book information  in the library. Here's how he'd do it:

In [ ]:
%%sql
SELECT * FROM Books;

 * sqlite:///unseen_library.db
Done.

[(1, 'The Transmuting Toadstool', 1, '1071-04-15', 'Transmutation', 310),
 (2, 'Ghoul Goulash: A Necromancy Narrative', 2, '1075-10-31', 'Necromancy', 500),
 (3, 'The Drunken Diviner', 3, '1077-07-07', 'Divination', 200),
 (4, 'Bewitched Broomsticks: Household Magic', 1, '1080-12-21', 'Household', 185),
 (5, 'Alchemy of Amphibians', 1, '1082-03-01', 'Transmutation', 312),
 (6, 'Lunch with the Living Dead', 2, '1086-08-15', 'Necromancy', 503),
 (7, 'The Prophetic Pint: A Tavern Diviner’s Guide', 3, '1088-09-09', 'Divination', 202),
 (8, 'Cauldron Conundrums: Household Spells', 1, '1090-01-31', 'Household', 190),
 (9, 'Frog or Prince? The Transmutation Dilemma', 1, '1095-05-05', 'Transmutation', 320),
 (10, 'Dinner with the Deceased: A Necromancer’s Diary', 2, '1100-12-01', 'Necromancy', 520),
 (11, 'The Seer’s Stein: A Pub Divination Primer', 3, '1107-11-11', 'Divination', 210),
 (12, 'Magic Mops and More: A Household Guide', 1, '1110-02-28', 'Household', 195),
 (13, 'Lizard or Lord? The Transmutation Challenge', 1, '1115-06-06', 'Transmutation', 330),
 (14, 'Resurrecting Rodents: A Necromancer’s Notes', 2, '1120-09-01', 'Necromancy', 550),
 (15, 'The Predictive Pilsner: Alehouse Divination Decoded', 3, '1125-11-11', 'Divination', 220)]

If the Librarian wants to view a list of all authors' names and their corresponding birthdates, we would use:

In [ ]:
%%sql
SELECT Name, Birthdate FROM Authors;

 * sqlite:///unseen_library.db
Done.

[('Mostrum Ridcully', '1045-02-28'),
 ('Granny Weatherwick', '1040-06-11'),
 ('Susan Death', '1070-12-17')]

These are very basic queries, but SQL becomes really powerful when you start filtering and ordering results, joining tables, and performing complex operations. We will cover those topics later in this chapter.

## Sorting and limiting with ORDER BY and LIMIT
After understanding how to use `SELECT` to fetch data, let's look at how to sort and limit the results we get using `ORDER BY` and `LIMIT`.

### ORDER BY
The `ORDER BY` keyword is used in SQL to sort the result-set in ascending or descending order. The `ORDER BY` keyword sorts the records in ascending order by default. If you want to sort the records in descending order, you can use the `DESC` keyword. Here's the basic syntax:
```
    SELECT column1, column2, ..., columnN
    FROM table_name
    ORDER BY column1 [ASC|DESC],
      column2 [ASC|DESC], ...
      columnN [ASC|DESC];

```
Let's say the librarian wants to view the book titles alphabetically. He would do:

In [ ]:
%%sql
SELECT Title FROM Books ORDER BY Title ASC;

 * sqlite:///unseen_library.db
Done.

[('Alchemy of Amphibians',),
 ('Bewitched Broomsticks: Household Magic',),
 ('Cauldron Conundrums: Household Spells',),
 ('Dinner with the Deceased: A Necromancer’s Diary',),
 ('Frog or Prince? The Transmutation Dilemma',),
 ('Ghoul Goulash: A Necromancy Narrative',),
 ('Lizard or Lord? The Transmutation Challenge',),
 ('Lunch with the Living Dead',),
 ('Magic Mops and More: A Household Guide',),
 ('Resurrecting Rodents: A Necromancer’s Notes',),
 ('The Drunken Diviner',),
 ('The Predictive Pilsner: Alehouse Divination Decoded',),
 ('The Prophetic Pint: A Tavern Diviner’s Guide',),
 ('The Seer’s Stein: A Pub Divination Primer',),
 ('The Transmuting Toadstool',)]

If he wants to view the authors in order of their birthdates, from oldest to youngest, he would do:

In [ ]:
%%sql
SELECT Name FROM Authors ORDER BY Birthdate ASC;

 * sqlite:///unseen_library.db
Done.

[('Granny Weatherwick',), ('Mostrum Ridcully',), ('Susan Death',)]

Conversely, if he wants to view the authors from youngest to oldest, he would simply replace `ASC` with `DESC:`

In [ ]:
%%sql
SELECT Name FROM Authors ORDER BY Birthdate DESC;

 * sqlite:///unseen_library.db
Done.

[('Susan Death',), ('Mostrum Ridcully',), ('Granny Weatherwick',)]

### LIMIT
The `LIMIT` keyword is used to set an upper limit on the number of tuples returned by SQL. It is useful when you want to test a query on a handful of rows of a table. Here's the basic syntax:

```
SELECT column1, column2, ..., columnN
FROM table_name
LIMIT number;
```

For instance, if the librarian only wants to see the first 5 books in the database when ordered by title, he would use:

In [ ]:
%%sql
SELECT * FROM Books ORDER BY Title ASC LIMIT 5;

 * sqlite:///unseen_library.db
Done.

[(5, 'Alchemy of Amphibians', 1, '1082-03-01', 'Transmutation', 312),
 (4, 'Bewitched Broomsticks: Household Magic', 1, '1080-12-21', 'Household', 185),
 (8, 'Cauldron Conundrums: Household Spells', 1, '1090-01-31', 'Household', 190),
 (10, 'Dinner with the Deceased: A Necromancer’s Diary', 2, '1100-12-01', 'Necromancy', 520),
 (9, 'Frog or Prince? The Transmutation Dilemma', 1, '1095-05-05', 'Transmutation', 320)]

If he only wants to see the three youngest authors:

In [ ]:
%%sql
SELECT Name FROM Authors ORDER BY Birthdate DESC LIMIT 3;

 * sqlite:///unseen_library.db
Done.

[('Susan Death',), ('Mostrum Ridcully',), ('Granny Weatherwick',)]

In these ways, `ORDER BY` and `LIMIT` help us handle the data returned by `SELECT` in more useful and manageable ways.

## Filtering Data with WHERE and LKE

The `WHERE` keyword is used to **filter** records based on specific conditions. It's used to extract only those records that fulfill a specified condition. Along with SELECT and FROM, a WHERE clause is part of almost every SQL query. The basic form is:

```
SELECT col1, col2, .... coln
FROM table
WHERE condition
```

For example, if the librarian wants to find a book with title "Alchemy of Amphibians," he could do the following:

In [ ]:
%%sql
SELECT * FROM Books WHERE Title = "Alchemy of Amphibians";

 * sqlite:///unseen_library.db
Done.

[(5, 'Alchemy of Amphibians', 1, '1082-03-01', 'Transmutation', 312)]

The `=` operator is used here to test equality. If he wants to find all books by a certain author, say an author with the Author_ID of 3, he could use:

In [ ]:
%%sql
SELECT * FROM Books WHERE Author_ID = 3;

 * sqlite:///unseen_library.db
Done.

[(3, 'The Drunken Diviner', 3, '1077-07-07', 'Divination', 200),
 (7, 'The Prophetic Pint: A Tavern Diviner’s Guide', 3, '1088-09-09', 'Divination', 202),
 (11, 'The Seer’s Stein: A Pub Divination Primer', 3, '1107-11-11', 'Divination', 210),
 (15, 'The Predictive Pilsner: Alehouse Divination Decoded', 3, '1125-11-11', 'Divination', 220)]

### LIKE
The `LIKE` operator is used in a `WHERE` clause to search for a specified pattern in a column. There are two wildcards used in conjunction with the `LIKE` operator:

-   `%`: The percent sign represents zero, one, or multiple characters.
-   `_`: The underscore represents a single character.

These symbols can be used in combinations. Here's the basic syntax:

```
SELECT column1, column2, ..., columnN
FROM table_name WHERE columnN
LIKE pattern;
```

For instance, if our librarian wants to find any books with a title that starts with "The", he could use:

In [ ]:
%%sql
SELECT * FROM Books WHERE Title LIKE 'The%';

 * sqlite:///unseen_library.db
Done.

[(1, 'The Transmuting Toadstool', 1, '1071-04-15', 'Transmutation', 310),
 (3, 'The Drunken Diviner', 3, '1077-07-07', 'Divination', 200),
 (7, 'The Prophetic Pint: A Tavern Diviner’s Guide', 3, '1088-09-09', 'Divination', 202),
 (11, 'The Seer’s Stein: A Pub Divination Primer', 3, '1107-11-11', 'Divination', 210),
 (15, 'The Predictive Pilsner: Alehouse Divination Decoded', 3, '1125-11-11', 'Divination', 220)]

This will match any book titles that start with "The", regardless of what follows after.

If he wants to find books with  genres that end with "n", he could do the following:

In [ ]:
%%sql

SELECT * FROM Books WHERE Genre LIKE "%n";

 * sqlite:///unseen_library.db
Done.

[(1, 'The Transmuting Toadstool', 1, '1071-04-15', 'Transmutation', 310),
 (3, 'The Drunken Diviner', 3, '1077-07-07', 'Divination', 200),
 (5, 'Alchemy of Amphibians', 1, '1082-03-01', 'Transmutation', 312),
 (7, 'The Prophetic Pint: A Tavern Diviner’s Guide', 3, '1088-09-09', 'Divination', 202),
 (9, 'Frog or Prince? The Transmutation Dilemma', 1, '1095-05-05', 'Transmutation', 320),
 (11, 'The Seer’s Stein: A Pub Divination Primer', 3, '1107-11-11', 'Divination', 210),
 (13, 'Lizard or Lord? The Transmutation Challenge', 1, '1115-06-06', 'Transmutation', 330),
 (15, 'The Predictive Pilsner: Alehouse Divination Decoded', 3, '1125-11-11', 'Divination', 220)]

Finally, he could look for books that had a colon (:) anywhere in the title

In [ ]:
%%sql
SELECT * FROM Books
WHERE Title LIKE "%:%"
LIMIT 5;

 * sqlite:///unseen_library.db
Done.

[(2, 'Ghoul Goulash: A Necromancy Narrative', 2, '1075-10-31', 'Necromancy', 500),
 (4, 'Bewitched Broomsticks: Household Magic', 1, '1080-12-21', 'Household', 185),
 (7, 'The Prophetic Pint: A Tavern Diviner’s Guide', 3, '1088-09-09', 'Divination', 202),
 (8, 'Cauldron Conundrums: Household Spells', 1, '1090-01-31', 'Household', 190),
 (10, 'Dinner with the Deceased: A Necromancer’s Diary', 2, '1100-12-01', 'Necromancy', 520)]

## Filtering Based on Numbers or Dates
The LIKE keyword is used for string/text data. However, we can also use `WHERE` to filter data that comes in the form of numbers or dates.


### Greater than `>` and Less than `<` Operators:
Let's say the librarian wants to find books that are more than 300 pages long. We could use the > operator:

In [ ]:
%%sql
SELECT * FROM Books WHERE Pages > 300;

 * sqlite:///unseen_library.db
Done.

[(1, 'The Transmuting Toadstool', 1, '1071-04-15', 'Transmutation', 310),
 (2, 'Ghoul Goulash: A Necromancy Narrative', 2, '1075-10-31', 'Necromancy', 500),
 (5, 'Alchemy of Amphibians', 1, '1082-03-01', 'Transmutation', 312),
 (6, 'Lunch with the Living Dead', 2, '1086-08-15', 'Necromancy', 503),
 (9, 'Frog or Prince? The Transmutation Dilemma', 1, '1095-05-05', 'Transmutation', 320),
 (10, 'Dinner with the Deceased: A Necromancer’s Diary', 2, '1100-12-01', 'Necromancy', 520),
 (13, 'Lizard or Lord? The Transmutation Challenge', 1, '1115-06-06', 'Transmutation', 330),
 (14, 'Resurrecting Rodents: A Necromancer’s Notes', 2, '1120-09-01', 'Necromancy', 550)]

Similarly, if he wants to find books that are less than 200 pages long, we would use the `<` operator:

In [ ]:
%%sql
SELECT * FROM Books WHERE Pages < 200;

 * sqlite:///unseen_library.db
Done.

[(4, 'Bewitched Broomsticks: Household Magic', 1, '1080-12-21', 'Household', 185),
 (8, 'Cauldron Conundrums: Household Spells', 1, '1090-01-31', 'Household', 190),
 (12, 'Magic Mops and More: A Household Guide', 1, '1110-02-28', 'Household', 195)]

This also works for dates. For example, if the librarian wants to find people born after 1050:

In [ ]:
%%sql
SELECT * FROM Authors WHERE Birthdate > '1050-01-01';

 * sqlite:///unseen_library.db
Done.

[(3, 'Susan Death', '1070-12-17')]

### BETWEEN Operator:
The `BETWEEN` operator selects values within a given range. The values can be numbers, text, or dates. It's inclusive: begin and end values are included.

If the librarian wants to find books with page numbers ranging between 200 and 300, he would use:

In [ ]:
%%sql
SELECT * FROM Books WHERE Pages BETWEEN 200 AND 300;

 * sqlite:///unseen_library.db
Done.

[(3, 'The Drunken Diviner', 3, '1077-07-07', 'Divination', 200),
 (7, 'The Prophetic Pint: A Tavern Diviner’s Guide', 3, '1088-09-09', 'Divination', 202),
 (11, 'The Seer’s Stein: A Pub Divination Primer', 3, '1107-11-11', 'Divination', 210),
 (15, 'The Predictive Pilsner: Alehouse Divination Decoded', 3, '1125-11-11', 'Divination', 220)]

Again, we can do this for dates as well. For example, let's find books published between 1080 and 1100.

In [ ]:
%%sql
SELECT * FROM Books
WHERE Publication_Date BETWEEN '1080-01-01' and '1100-01-01';

 * sqlite:///unseen_library.db
Done.

[(4, 'Bewitched Broomsticks: Household Magic', 1, '1080-12-21', 'Household', 185),
 (5, 'Alchemy of Amphibians', 1, '1082-03-01', 'Transmutation', 312),
 (6, 'Lunch with the Living Dead', 2, '1086-08-15', 'Necromancy', 503),
 (7, 'The Prophetic Pint: A Tavern Diviner’s Guide', 3, '1088-09-09', 'Divination', 202),
 (8, 'Cauldron Conundrums: Household Spells', 1, '1090-01-31', 'Household', 190),
 (9, 'Frog or Prince? The Transmutation Dilemma', 1, '1095-05-05', 'Transmutation', 320)]

As you can see, the `WHERE` clause becomes extremely powerful when combined with these operators, allowing for complex and specific queries.

## Combining Conditiosns With AND, OR, and NOT
When querying a relational database using SQL, it is often necessary to specify multiple conditions that a record must meet. SQL provides three logical operators for this purpose: AND, OR, and NOT.

### AND
The AND operator allows you to select only those records that satisfy *all* specified conditions. If you use the AND operator between two conditions, both of them must be true for a row to be included in the result set.

Let's say we want to find all books that are of the 'Transmutation' genre and have more than 300 pages. For that, we can use the AND operator:

In [ ]:
%%sql
SELECT * FROM Books
WHERE Genre = 'Transmutation' AND Pages > 300;

 * sqlite:///unseen_library.db
Done.

[(1, 'The Transmuting Toadstool', 1, '1071-04-15', 'Transmutation', 310),
 (5, 'Alchemy of Amphibians', 1, '1082-03-01', 'Transmutation', 312),
 (9, 'Frog or Prince? The Transmutation Dilemma', 1, '1095-05-05', 'Transmutation', 320),
 (13, 'Lizard or Lord? The Transmutation Challenge', 1, '1115-06-06', 'Transmutation', 330)]

### OR
The OR operator allows you to select records that satisfy *any* of the specified conditions. If you use the OR operator between two conditions, a row will be included in the result set if either (or both) of the conditions is true.

Now, let's say we want to find books that are either of the 'Necromancy' genre or were published after 1100. For this, we can use the OR operator:

In [ ]:
%%sql
SELECT * FROM Books
WHERE Genre = 'Necromancy' OR Publication_Date > '1100-01-01';

 * sqlite:///unseen_library.db
Done.

[(2, 'Ghoul Goulash: A Necromancy Narrative', 2, '1075-10-31', 'Necromancy', 500),
 (6, 'Lunch with the Living Dead', 2, '1086-08-15', 'Necromancy', 503),
 (10, 'Dinner with the Deceased: A Necromancer’s Diary', 2, '1100-12-01', 'Necromancy', 520),
 (11, 'The Seer’s Stein: A Pub Divination Primer', 3, '1107-11-11', 'Divination', 210),
 (12, 'Magic Mops and More: A Household Guide', 1, '1110-02-28', 'Household', 195),
 (13, 'Lizard or Lord? The Transmutation Challenge', 1, '1115-06-06', 'Transmutation', 330),
 (14, 'Resurrecting Rodents: A Necromancer’s Notes', 2, '1120-09-01', 'Necromancy', 550),
 (15, 'The Predictive Pilsner: Alehouse Divination Decoded', 3, '1125-11-11', 'Divination', 220)]

### NOT
The NOT operator is used to exclude records that match a certain condition. When you put NOT before a condition, the condition is reversed: the query will return only the rows for which that condition is false.

Suppose we want to find all books that are not of the 'Divination' genre. We can use the NOT operator for this:

In [ ]:
%%sql
SELECT * FROM Books
WHERE NOT Genre = 'Divination'
LIMIT 5;

 * sqlite:///unseen_library.db
Done.

[(1, 'The Transmuting Toadstool', 1, '1071-04-15', 'Transmutation', 310),
 (2, 'Ghoul Goulash: A Necromancy Narrative', 2, '1075-10-31', 'Necromancy', 500),
 (4, 'Bewitched Broomsticks: Household Magic', 1, '1080-12-21', 'Household', 185),
 (5, 'Alchemy of Amphibians', 1, '1082-03-01', 'Transmutation', 312),
 (6, 'Lunch with the Living Dead', 2, '1086-08-15', 'Necromancy', 503)]

We could also do this using the not-equal operator `!=`

In [ ]:
%%sql
SELECT * FROM Books
WHERE NOT Genre = 'Divination';

In all these examples, the conditions we've specified after the WHERE keyword determine which rows will be included in the results. By using AND, OR, and NOT, we can create complex queries that return exactly the data we're interested in.

In [ ]:
%%sql
SELECT * FROM Books
WHERE Genre != 'Divination'
LIMIT 5;

 * sqlite:///unseen_library.db
Done.

[(1, 'The Transmuting Toadstool', 1, '1071-04-15', 'Transmutation', 310),
 (2, 'Ghoul Goulash: A Necromancy Narrative', 2, '1075-10-31', 'Necromancy', 500),
 (4, 'Bewitched Broomsticks: Household Magic', 1, '1080-12-21', 'Household', 185),
 (5, 'Alchemy of Amphibians', 1, '1082-03-01', 'Transmutation', 312),
 (6, 'Lunch with the Living Dead', 2, '1086-08-15', 'Necromancy', 503)]

## Basic SQL: Summary Table
Here's a table summarizing some of the queries we've covered:
Sure, here's a table summarizing our queries:

| English Description | SQL Query |
| --- | --- |
| Select all columns from the Books table | `SELECT * FROM Books;` |
| Select the Title column from the Books table | `SELECT Title FROM Books;` |
| Select the Name and Birthdate columns from the Authors table | `SELECT Name, Birthdate FROM Authors;` |
| Select all columns from the Books table, ordered by Title in ascending order | `SELECT * FROM Books ORDER BY Title ASC;` |
| Select the Name column from the Authors table, ordered by Birthdate in ascending (oldest first) order | `SELECT Name FROM Authors ORDER BY Birthdate ASC;` |
| Select the Name column from the Authors table, ordered by Birthdate in descending (youngest first) order | `SELECT Name FROM Authors ORDER BY Birthdate DESC;` |
| Select the first 5 rows from the Books table, ordered by Title in ascending order | `SELECT * FROM Books ORDER BY Title ASC LIMIT 5;` |
| Select the first 3 rows from the Authors table, ordered by Birthdate in descending order | `SELECT * FROM Authors ORDER BY Birthdate DESC LIMIT 3;` |
| Select all columns from the Books table where Title is 'The Abominable Teapot of Terror' | `SELECT * FROM Books WHERE Title = 'The Abominable Teapot of Terror';` |
| Select all columns from the Books table where Author_ID is 3 | `SELECT * FROM Books WHERE Author_ID = 3;` |
| Select all columns from the Books table where Title starts with 'The' | `SELECT * FROM Books WHERE Title LIKE 'The%';` |
| Select all columns from the Books table where Title contains exactly one character | `SELECT * FROM Books WHERE Title LIKE '_';` |
| Select all columns from the Books table where Num_Pages is more than 300 | `SELECT * FROM Books WHERE Num_Pages > 300;` |
| Select all columns from the Books table where Num_Pages is less than 200 | `SELECT * FROM Books WHERE Num_Pages < 200;` |
| Select all columns from the Books table where Num_Pages is between 200 and 300 | `SELECT * FROM Books WHERE Num_Pages BETWEEN 200 AND 300;` |
| Select all columns from the Authors table where Birthdate is after 1950 | `SELECT * FROM Authors WHERE Birthdate > '1950-01-01';` |
| Select all columns from the Authors table where Birthdate is between 1920 and 1950 | `SELECT * FROM Authors WHERE Birthdate BETWEEN '1920-01-01' AND '1950-12-31';` |
| Find books from Transmutation genre that more than 300 pages. |`SELECT * FROM Books WHERE Genre = 'Transmutation' AND Pages > 300;` |
| Find books that are either of the 'Necromancy' genre or were published after 1100. | `SELECT * FROM Books WHERE Genre = 'Necromancy' OR Publication_Date > '1100-01-01'`;|

## Exercises

1.  Write a SQL query to select all columns from the "Books" table where the "Genre" is 'Divination'.

2.  Write a SQL query to select the "Title" and "Pages" columns from the "Books" table where the number of pages is less than 100.

3.  Write a SQL query to select all columns from the "Authors" table, ordered by "Name" in descending (Z-A) order.

4.  Write a SQL query to select the first 10 rows from the "Books" table, ordered by "Pages" in descending (most pages first) order.

5. Write a SQL query to select all columns from the "Books" table where the "Title" column contains the word 'or' (Hint: use the LIKE operator).

6.  Write a SQL query to select all columns from the "Books" table where the "Title" ends with 'Guide' (Hint: use the LIKE operator).

7.   Write a SQL query to select all columns from the "Authors" table where the "Birthdate" is before the year 1050.

8.  Write a SQL query to select all columns from the "Books" table where the "Pages" is between 150 and 300 and the "Genre" is 'Necromancy'.

In [ ]:
%%sql
-- Ex 1

In [ ]:
%%sql
-- Ex 2

In [ ]:
%%sql
-- Ex 3

In [ ]:
%%sql
-- Ex 4

In [ ]:
%%sql
-- Ex 5

In [ ]:
%%sql
-- Ex 6

In [ ]:
%%sql
-- Ex 7

In [ ]:
%%sql
-- Ex 8

## Glossary
| Term | Definition |
| --- | --- |
| Relational Model | A type of data model that organizes data into tables (or relations), which can be linked---or related---based on data common to each. |
| Edgar Codd | A British computer scientist known for inventing the relational model for database management. |
| Table (Relation) | In the context of databases, it is a set of data elements organized using a model of vertical columns (which are identified by their name) and horizontal rows. |
| Attribute | A column in a table. Each attribute represents a specific piece of data, like a name or date, associated with the object modeled by the table. |
| Primary Key | A field in a table which is used to uniquely identify each record in that table. |
| Foreign Key | A field in one table that uniquely identifies a row of another table, establishing a link between them. |
| Relationship Cardinality | The numerical mapping between entities (or tables). It shows the number of instances of one entity that can, or must, be associated with each instance of another entity. |
| One-to-One | A type of relationship where a single record in one table is linked to a single record in another table. |
| One-to-Many | A type of relationship where one record in a table can be linked to multiple records in another table. |
| Many-to-Many | A type of relationship where multiple records in a table can be associated with multiple records in another table. |
| Data Definition Language (DDL) | A subset of SQL used to define and manage database structures, including creating, altering, and dropping tables. |
| Data Manipulation Language (DML) | A subset of SQL used to retrieve, insert, modify, and delete data in a database. |
| Database Normalization Form | Rules used to design tables where the data dependencies are logical, avoiding redundancy and anomalies. |
| First Normal Form (1NF) | A database normalization form that eliminates duplicate columns from the same table and identifies each piece of data by a unique key. |
| Second Normal Form (2NF) | A database normalization form that requires a table to be in First Normal Form and also requires that all non-key attributes be fully dependent on the primary key. |
| Third Normal Form (3NF) | A database normalization form that requires a table to be in Second Normal Form and also requires that all columns be directly dependent on the primary key. |